[TechnologyLevelFilter X2FMA3ItemTemplateBasedCategoryFilter]
OptionDisplayTitle="科技等级"
; Do not translate the CategoryName for other languages, it is used to assign the DisplayName to the correct location.
+CategoryDisplayNames=(CategoryName="beam",CategoryDisplayName="电浆")
+CategoryDisplayNames=(CategoryName="magnetic",CategoryDisplayName="磁力")
+CategoryDisplayNames=(CategoryName="conventional",CategoryDisplayName="传统武器")
+CategoryDisplayNames=(CategoryName="plated",CategoryDisplayName="电镀")
+CategoryDisplayNames=(CategoryName="powered",CategoryDisplayName="动力")
+CategoryDisplayNames=(CategoryName="",CategoryDisplayName="未分类")

[WeaponCategoryFilter X2FMA3ItemTemplateBasedCategoryFilter]
OptionDisplayTitle="武器种类"
+CategoryDisplayNames=(CategoryName="Explosives",CategoryDisplayName="爆破类")
+CategoryDisplayNames=(CategoryName="Melee",CategoryDisplayName="近战")
+CategoryDisplayNames=(CategoryName="Utility",CategoryDisplayName="Utility")
+CategoryDisplayNames=(CategoryName="bullpup",CategoryDisplayName="无托式")
+CategoryDisplayNames=(CategoryName="cannon",CategoryDisplayName="机枪、加农炮")
+CategoryDisplayNames=(CategoryName="rifle",CategoryDisplayName="步枪")
+CategoryDisplayNames=(CategoryName="shotgun",CategoryDisplayName="霰弹枪")
+CategoryDisplayNames=(CategoryName="sidearm",CategoryDisplayName="圣殿拳套")
+CategoryDisplayNames=(CategoryName="sniper_rifle",CategoryDisplayName="狙击枪")
+CategoryDisplayNames=(CategoryName="sparkrifle",CategoryDisplayName="Spark加农炮")
+CategoryDisplayNames=(CategoryName="vektor_rifle",CategoryDisplayName="维克托步枪")

[ArmorCategoryFilter X2FMA3ItemTemplateBasedCategoryFilter]
OptionDisplayTitle="护甲种类"

[ArmorClassFilter X2FMA3ItemTemplateBasedCategoryFilter]
OptionDisplayTitle="护甲等级"

[ItemCategoryFilter X2FMA3ItemTemplateBasedCategoryFilter]
OptionDisplayTitle="物品分类"
; Game default is in caps so we override localization
+CategoryDisplayNames=(CategoryName="Ammo",CategoryDisplayName="弹药")
+CategoryDisplayNames=(CategoryName="Armor",CategoryDisplayName="护甲")
+CategoryDisplayNames=(CategoryName="CombatSim",CategoryDisplayName="个人芯片")
+CategoryDisplayNames=(CategoryName="DefenseMerged",CategoryDisplayName="防御")
+CategoryDisplayNames=(CategoryName="Mission",CategoryDisplayName="任务")
+CategoryDisplayNames=(CategoryName="Resource",CategoryDisplayName="资源")
; not sure yet which items are of this category so no better name
;+CategoryDisplayNames=(CategoryName="Tech",CategoryDisplayName="科技")
+CategoryDisplayNames=(CategoryName="Upgrade",CategoryDisplayName="配件")
+CategoryDisplayNames=(CategoryName="Utility",CategoryDisplayName="通用物品")
+CategoryDisplayNames=(CategoryName="Weapon",CategoryDisplayName="武器")
; probably exclude this from item categories
+CategoryDisplayNames=(CategoryName="goldenpath",CategoryDisplayName="战役")
; Game default is in caps so we override localization
+CategoryDisplayNames=(CategoryName="grenade",CategoryDisplayName="榴弹")
;+CategoryDisplayNames=(CategoryName="heal",CategoryDisplayName="治疗物品")
;+CategoryDisplayNames=(CategoryName="psidefense",CategoryDisplayName="灵能防御")
; also exclude this
+CategoryDisplayNames=(CategoryName="quest",CategoryDisplayName="寻找")

[ClassRestrictionFilter X2FMA3ItemTemplateBasedCategoryFilter]
OptionDisplayTitle="职业限制"
; This one has the rest of its localization done automatically, via the localization provided for classes
; Only add localization to override the automatically generated loc or to handle multiple classes put into one category in the config file

[SoldierClassFilter X2FMA3BasicCategoryFilterTemplate]
OptionDisplayTitle="士兵职业"

[SoldierRankFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="士兵军阶"
; Ranks dont really have one naming scheme (cf. Templar, Spark)
; Also this type of filter would not support it anyway, while being the simplest solution
SingularUnitText="晋升"
PluralUnitText="晋升"
ZeroUnitText="新兵"

[ProjectDurationFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="项目期限"
SingularUnitText="天"
PluralUnitText="天"
ZeroUnitText="即时"

[AlloyCostFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="外星人合金"
SingularUnitText="合金"
PluralUnitText="合金"
ZeroUnitText="免费"

[EleriumCostFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="超铀"
SingularUnitText="超铀"
PluralUnitText="超铀"
ZeroUnitText="免费"

[IntelCostFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="情报"
SingularUnitText="情报"
PluralUnitText="情报"
ZeroUnitText="免费"

[SupplyCostFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="补给"
SingularUnitText="补给"
PluralUnitText="补给"
ZeroUnitText="免费"

[EleriumCoreCostFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="超铀核心"
SingularUnitText="核心"
PluralUnitText="核心"
ZeroUnitText="免费"

[UIFMA3SimpleFilterPanel]
FilterPanelTitle="过滤器"
ApplyButtonText="应用"
ResetButtonText="默认"
FilterSelectionHeader="过滤选项"
OptionHeader="过滤器设定"

[X2FMA3CombinedFilterTemplate]
SubOptionsHeader="子选项"

[CombinedCostResearchAndProjectFilter X2FMA3CombinedFilterTemplate]
OptionDisplayTitle="花费"

[CombinedCostBuildItemsFilter X2FMA3CombinedFilterTemplate]
OptionDisplayTitle="花费"

[TechTypeFilter X2FMA3BasicCategoryFilterTemplate]
OptionDisplayTitle="研究类型"
+CategoryDisplayNames=(CategoryName="Autopsy",CategoryDisplayName="解剖")
+CategoryDisplayNames=(CategoryName="Breakthrough",CategoryDisplayName="突破进展")
+CategoryDisplayNames=(CategoryName="Repeatable",CategoryDisplayName="可重复")
+CategoryDisplayNames=(CategoryName="Armor",CategoryDisplayName="护甲")
+CategoryDisplayNames=(CategoryName="Weapon",CategoryDisplayName="武器")
+CategoryDisplayNames=(CategoryName="None",CategoryDisplayName="其他")

[SoldierAimFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="命中率"
SingularUnitText="命中"
PluralUnitText="命中"
ZeroUnitText="0 命中"

[SoldierWillFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="意志力"
SingularUnitText="意志"
PluralUnitText="意志"
ZeroUnitText="0 意志"

[SoldierHitPointsFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="生命指"
SingularUnitText="HP"
PluralUnitText="HP"
ZeroUnitText="0 HP"

[SoldierDodgeFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="防御"
SingularUnitText="防御"
PluralUnitText="防御"
ZeroUnitText="0 防御"

[SoldierArmorFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="护甲"
SingularUnitText="护甲"
PluralUnitText="护甲"
ZeroUnitText="未装备护甲"

[SoldierHackFilter X2FMA3NumberRangeFilterTemplate]
OptionDisplayTitle="电子骇入"
SingularUnitText="骇入"
PluralUnitText="骇入"
ZeroUnitText="0 骇入"

[CombinedSoldierStatFilter X2FMA3CombinedFilterTemplate]
OptionDisplayTitle="士兵状态"
